RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Source/gd32f5xx_i2c_add.c
/*!
    \brief      enable SMBus device default address
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_add_smbus_default_addr_enable(uint32_t i2c_add_periph)
{
    I2C_ADD_CTL0(i2c_add_periph) |= I2C_ADD_CTL0_SMBDAEN;
}

/*!
    \brief      disable SMBus device default address
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_add_smbus_default_addr_disable(uint32_t i2c_add_periph)
{
    I2C_ADD_CTL0(i2c_add_periph) &= ~I2C_ADD_CTL0_SMBDAEN;
}

/*!
    \brief      enable SMBus Host address
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_add_smbus_host_addr_enable(uint32_t i2c_add_periph)
{
    I2C_ADD_CTL0(i2c_add_periph) |= I2C_ADD_CTL0_SMBHAEN;
}

/*!
    \brief      disable SMBus Host address
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_add_smbus_host_addr_disable(uint32_t i2c_add_periph)
{
    I2C_ADD_CTL0(i2c_add_periph) &= ~I2C_ADD_CTL0_SMBHAEN;
}

/*!
    \brief      enable extended clock timeout detection
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[out] none
    \retval     none
*/
void i2c_add_extented_clock_timeout_enable(uint32_t i2c_add_periph)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) |= I2C_ADD_TIMEOUT_EXTOEN;
}

/*!
    \brief      disable extended clock timeout detection
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[out] none
    \retval     none
*/
void i2c_add_extented_clock_timeout_disable(uint32_t i2c_add_periph)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) &= ~I2C_ADD_TIMEOUT_EXTOEN;
}

/*!
    \brief      enable clock timeout detection
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[out] none
    \retval     none
*/
void i2c_add_clock_timeout_enable(uint32_t i2c_add_periph)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) |= I2C_ADD_TIMEOUT_TOEN;
}

/*!
    \brief      disable clock timeout detection
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[out] none
    \retval     none
*/
void i2c_add_clock_timeout_disable(uint32_t i2c_add_periph)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) &= ~I2C_ADD_TIMEOUT_TOEN;
}

/*!
    \brief      configure bus timeout B
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  timeout: bus timeout B
    \param[out] none
    \retval     none
*/
void i2c_add_bus_timeout_b_config(uint32_t i2c_add_periph, uint32_t timeout)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) &= ~I2C_ADD_TIMEOUT_BUSTOB;
    I2C_ADD_TIMEOUT(i2c_add_periph) |= (uint32_t)(timeout << TIMEOUT_BUSTOB_OFFSET);
}

/*!
    \brief      configure bus timeout A
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  timeout: bus timeout A
    \param[out] none
    \retval     none
*/
void i2c_add_bus_timeout_a_config(uint32_t i2c_add_periph, uint32_t timeout)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) &= ~I2C_ADD_TIMEOUT_BUSTOA;
    I2C_ADD_TIMEOUT(i2c_add_periph) |= timeout;
}

/*!
    \brief      configure idle clock timeout detection
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  timeout: bus timeout A
      \arg        BUSTOA_DETECT_SCL_LOW: BUSTOA is used to detect SCL low timeout
      \arg        BUSTOA_DETECT_IDLE: BUSTOA is used to detect both SCL and SDA high timeout when the bus is idle
    \param[out] none
    \retval     none
*/
void i2c_add_idle_clock_timeout_config(uint32_t i2c_add_periph, uint32_t timeout)
{
    I2C_ADD_TIMEOUT(i2c_add_periph) &= ~I2C_ADD_TIMEOUT_TOIDLE;
    I2C_ADD_TIMEOUT(i2c_add_periph) |= timeout;
}

/*!
    \brief      get I2C flag status
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  flag: I2C flags
                only one parameter can be selected which is shown as below:
      \arg        I2C_ADD_FLAG_TBE: I2C_ADD_TDATA is empty during transmitting
      \arg        I2C_ADD_FLAG_TI: transmit interrupt
      \arg        I2C_ADD_FLAG_RBNE: I2C_ADD_RDATA is not empty during receiving
      \arg        I2C_ADD_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_ADD_FLAG_NACK: not acknowledge flag
      \arg        I2C_ADD_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_ADD_FLAG_TC: transfer complete in master mode
      \arg        I2C_ADD_FLAG_TCR: transfer complete reload
      \arg        I2C_ADD_FLAG_BERR: bus error
      \arg        I2C_ADD_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_ADD_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_ADD_FLAG_PECERR: PEC error
      \arg        I2C_ADD_FLAG_TIMEOUT: timeout flag
      \arg        I2C_ADD_FLAG_SMBALT: SMBus Alert
      \arg        I2C_ADD_FLAG_I2CBSY: busy flag
      \arg        I2C_ADD_FLAG_TR: whether the I2C is a transmitter or a receiver in slave mode
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_add_flag_get(uint32_t i2c_add_periph, uint32_t flag)
{
    if(RESET != (I2C_ADD_STAT(i2c_add_periph) & flag)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear I2C flag status
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  flag: I2C flags
                one or more parameters can be selected which are shown as below:
      \arg        I2C_ADD_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_ADD_FLAG_NACK: not acknowledge flag
      \arg        I2C_ADD_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_ADD_FLAG_BERR: bus error
      \arg        I2C_ADD_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_ADD_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_ADD_FLAG_PECERR: PEC error
      \arg        I2C_ADD_FLAG_TIMEOUT: timeout flag
      \arg        I2C_ADD_FLAG_SMBALT: SMBus Alert
    \param[out] none
    \retval     none
*/
void i2c_add_flag_clear(uint32_t i2c_add_periph, uint32_t flag)
{
    I2C_ADD_STATC(i2c_add_periph) |= flag;
}

/*!
    \brief      enable I2C interrupt
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  interrupt: I2C interrupts
                one or more parameters can be selected which are shown as below:
      \arg        I2C_ADD_INT_ERR: error interrupt
      \arg        I2C_ADD_INT_TC: transfer complete interrupt
      \arg        I2C_ADD_INT_STPDET: stop detection interrupt
      \arg        I2C_ADD_INT_NACK: not acknowledge received interrupt
      \arg        I2C_ADD_INT_ADDM: address match interrupt
      \arg        I2C_ADD_INT_RBNE: receive interrupt
      \arg        I2C_ADD_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_add_interrupt_enable(uint32_t i2c_add_periph, uint32_t interrupt)
{
    I2C_ADD_CTL0(i2c_add_periph) |= interrupt;
}

/*!
    \brief      disable I2C interrupt
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  interrupt: I2C interrupts
                one or more parameters can be selected which are shown as below:
      \arg        I2C_ADD_INT_ERR: error interrupt
      \arg        I2C_ADD_INT_TC: transfer complete interrupt
      \arg        I2C_ADD_INT_STPDET: stop detection interrupt
      \arg        I2C_ADD_INT_NACK: not acknowledge received interrupt
      \arg        I2C_ADD_INT_ADDM: address match interrupt
      \arg        I2C_ADD_INT_RBNE: receive interrupt
      \arg        I2C_ADD_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_add_interrupt_disable(uint32_t i2c_add_periph, uint32_t interrupt)
{
    I2C_ADD_CTL0(i2c_add_periph) &= ~interrupt;
}

/*!
    \brief      get I2C interrupt flag status
    \param[in]  i2c_add_periph: I2Cx(x=3,4,5)
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_add_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_ADD_INT_FLAG_TI: transmit interrupt flag
      \arg        I2C_ADD_INT_FLAG_RBNE: I2C_ADD_RDATA is not empty during receiving interrupt flag
      \arg        I2C_ADD_INT_FLAG_ADDSEND: address received matches in slave mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_NACK: not acknowledge interrupt flag
      \arg        I2C_ADD_INT_FLAG_STPDET: stop condition detected in slave mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_TC: transfer complete in master mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_TCR: transfer complete reload interrupt flag
      \arg        I2C_ADD_INT_FLAG_BERR: bus error interrupt flag
      \arg        I2C_ADD_INT_FLAG_LOSTARB: arbitration lost interrupt flag
      \arg        I2C_ADD_INT_FLAG_OUERR: overrun/underrun error in slave mode interrupt flag
      \arg        I2C_ADD_INT_FLAG_PECERR: PEC error interrupt flag
      \arg        I2C_ADD_INT_FLAG_TIMEOUT: timeout interrupt flag
      \arg        I2C_ADD_INT_FLAG_SMBALT: SMBus Alert interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_add_interrupt_flag_get(uint32_t i2c_add_periph, i2c_add_interrupt_flag_enum int_flag)
{
    uint32_t ret1 = RESET;
    uint32_t ret2 = RESET;

